app/controllers/contatos_controller.rb

  def index
    @contatos = Contato.all
---
SELECT "contatos".* FROM "contatos"

  def create
    @contato = Contato.new(contato_params)

    respond_to do |format|
      if @contato.save
---
INSERT INTO "contatos" ("trabalhador_id", "telefone", "celular", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def set_contato
      @contato = Contato.find(params[:id])
---
SELECT  "contatos".* FROM "contatos" WHERE "contatos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]