app/controllers/trabalhadors_controller.rb

  def index

    @trabalhadors = Trabalhador.all
---
SELECT "trabalhadors".* FROM "trabalhadors" WHERE (job_role like '%dona%')

  def create
    @trabalhador = Trabalhador.new(trabalhador_params)

    respond_to do |format|
      if @trabalhador.save
---
INSERT INTO "trabalhadors" ("nome", "matricula", "nascimento", "sexo", "civil", "cidade", "estado", "workspace", "job_role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_trabalhador
      @trabalhador = Trabalhador.find(params[:id])
---
SELECT  "trabalhadors".* FROM "trabalhadors" WHERE "trabalhadors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]